const DeliveryTextFirst = () => {
  return (
    <ol className="pl-4 text-xs vsm:text-base">
      <li>
        <p>
          Быстрая доставка из магазина В городах присутствия супермаркетов «KK
          Shop» действует быстрая доставка из магазина день в день. Доступные
          способы оплаты: банковской картой, подарочной картой. Возможно
          применение бонусов. Применение подарочной карты и бонусов возможно
          только при онлайн-оплате. Как оформить заказ с доставкой из магазина в
          вашем городе:
        </p>
        <p className="pl-7 mt-4">
          Выберите нужные средства на сайте. <br /> Проверьте их наличие в
          магазине вашего города. <br /> Оформите заказ на сайте, выбрав способ
          «быстрая доставка из магазина». <br /> Вы получите SMS-сообщение, как
          только заказ будет собран и передан курьеру. <br /> Ждите курьера с
          посылкой!
        </p>

        <p className="mt-4">
          Быстрая доставка действует во всех городах присутствия. Обращаем
          внимание, в Екатеринбурге доставка из магазина действует только в
          Универмаге BOLSHOY; в Казани - только в супермаркете по адресу ул.
          Пушкина, 2; в Москве - только в ТЦ Афимолл Сити, ТЦ Кунцево Плаза, ТЦ
          Метрополис, ТЦ Саларис. **Быстрая доставка из магазина в день заказа
          действует во всех городах присутствия, кроме Москвы.
        </p>

        <div className="mt-8">
          <h6 className="font-bold text-xl">Интервалы доставки:</h6>{" "}
          <p className="mt-10">
            В Москве: заказы, оформленные до 21:00, доставляем на следующий
            день. Доступные интервалы доставки: 10:00 - 18:00, 10:00 - 14:00,
            14:00 - 18:00, 18:00 - 22:00. В Санкт-Петербурге: заказы,
            оформленные до 04:00, доставляем в этот же день. Доступные интервалы
            доставки: 10:00 - 18:00, 10:00 - 14:00, 14:00 - 18:00. Заказы,
            оформленные до 14:00, доставляем в этот же день в интервале 18:00 -
            23:00.
          </p>{" "}
          <br />
          <p>
            В Екатеринбурге, Челябинске, Казани, Нижнем Новгороде, Волгограде,
            Новосибирске, Ростове-на-Дону, Самаре, Саратове и Хабаровске:
            заказы, оформленные до 18:00, доставляем в этот же день. Доступные
            интервалы доставки: 10:00 − 13:00, 13:00 − 16:00, 16:00 − 19:00,
            19:00 − 23:00.
          </p>{" "}
          <br />
          <p>
            Обращаем ваше внимание, при выборе способа доставки “быстрая
            доставка из магазина” в Москве доступна оплата на сайте при
            оформлении заказа или банковской картой при получении.
          </p>
        </div>
      </li>
      <li className="mt-4">
        <p>
          Самовывоз из магазина. <br /> Доступные способы оплаты: банковской
          картой, наличными, подарочными картами.
        </p>{" "}
        <p className="mt-2">Как оформить заказ с самовывозом из магазина:</p>
        <p className="pl-7 mt-4">
          Выберите нужные средства на сайте. <br /> Проверьте их наличие в
          магазине вашего города. <br /> При оформлении заказа выберите способ
          доставки «самовывоз из магазина». <br /> Как только заказ будет
          собран, вы получите SMS-сообщение. <br /> Заберите ваш заказ из
          магазина.
        </p>
        <div className="mt-4">
          <h6 className="font-bold text-xl">Обращаем ваше внимание:</h6>
          <p>
            – Срок хранения заказа - 3 дня с момента сбора. <br /> – Если товара
            из корзины не окажется в наличии, с вами свяжется оператор для
            уточнения деталей заказа. <br /> *Самовывоз действует во всех
            городах присутствия. Обращаем внимание, в Москве самовывоз действует
            только в ТЦ Афимолл Сити, ТЦ Метрополис, ТЦ Кунцево Плаза, ТРЦ
            Саларис.
          </p>
        </div>
      </li>
      <li className="mt-4">
        Курьерская доставка на выбранный адрес. Доставка осуществляется
        курьерскими компаниями. Доступные способы оплаты: банковской картой,
        наличными, применение подарочной карты невозможно. Обращаем ваше
        внимание, курьерская служба Золотого Яблока принимает только безналичный
        расчёт.
      </li>
      <li className="mt-4">
        Самовывоз из пунктов выдачи заказов курьерских служб. Перечень адресов
        выдачи доступен при выборе данного способа доставки. Доступные способы
        оплаты: банковской картой при наличии технической возможности,
        наличными, применение бонусов невозможно. Подарочные карты к оплате не
        принимаются.
      </li>
      <li className="mt-4">
        Самовывоз из почтовых отделений Почты России, доставку осуществляет ФГУП
        «Почта России». Доступные способы оплаты: банковской картой при наличии
        технической возможности, наличными, применение бонусов невозможно.
        Подарочные карты к оплате не принимаются.
      </li>
    </ol>
  );
}

export default DeliveryTextFirst